In [1]:
import pandas as pd
import psycopg2 as psy
import sqlalchemy # Thư viện dành cho hiển thị sql trong file

In [13]:
# Thông tin kết nối
"""
conn = psy.connect(
    host="153.92.214.210",
    database="er_sample",
    user="postgres",
    password="98919891",
    port="5432")
"""

'\nconn = psy.connect(\n    host="153.92.214.210",\n    database="er_sample",\n    user="postgres",\n    password="98919891",\n    port="5432")\n'

In [2]:
# Import thư viện kết nối với postgresql
from sqlalchemy import create_engine
engine = create_engine('postgresql://postgres:98919891@153.92.214.210:5432/er_sample')

In [3]:
# Bắt đầu cho phép sử dụng sql trong dòng lệnh
%reload_ext sql

In [4]:
# Khởi tạo kết nối với server database
%sql postgresql://postgres:98919891@153.92.214.210:5432/er_sample

<h1> -- CHAPTER 7 -- <h1/>

<h2>7.1<h2/>

In [5]:
%%sql
SELECT
    address AS "住所"
FROM
    member
WHERE
    post_code
LIKE
    '18%'
;

 * postgresql://postgres:***@153.92.214.210:5432/er_sample
2 rows affected.

[('東京都東村山市栄町9-22-2-101',), ('東京都東村山市富士見町1-8',)]

<h2> 7.2 <h2/>

In [6]:
%%sql
SELECT
    book_name AS "書籍名",
    page_count AS "ページ数",
    price AS "価格"
FROM
    book
WHERE
    book_name
LIKE
    '%版'
;

 * postgresql://postgres:***@153.92.214.210:5432/er_sample
3 rows affected.

[('Effective Ruby 第2版', 327, 3780),
 ('満月の神話 新装版', 328, 3360),
 ('秘伝のタレ 新版', 555, 3999)]

<h2>7.3 <h2/>
 名が 2 文字の「子」で終わる会員の姓、名の一覧を、結果表の見出しが
「姓」、「名」となるように表示しなさい。

In [7]:
%%sql
SELECT
    first_name AS "名",
    last_name AS "姓"
FROM
    member
WHERE
    first_name
LIKE
    '%子子'
;

 * postgresql://postgres:***@153.92.214.210:5432/er_sample
0 rows affected.

[]

-------------
<h1>-- CHAPTER 8<h1/>
<h2>
8.4.1 価格が 2000 円以上でページ数が 320 未満の書籍 ID、書籍名、ISBN の一覧を、
結果表の見出しが「書籍 ID」、「書籍名」、「ISBN」となるように表示しなさい。
*/
<h2/>

In [8]:
%%sql
SELECT
    book_id AS "書籍 ID",
    book_name AS "書籍名",   
    isbn13 AS "ISBN"
FROM
    book
WHERE
    page_count < 320
AND
    price >= 2000
;

 * postgresql://postgres:***@153.92.214.210:5432/er_sample
5 rows affected.

[('B0000003', '真珠のプログラミング', '978-4894712360'),
 ('B0000018', 'ウィン 勝利の経営', '978-4894716320'),
 ('B0000042', '週末のオブジェクト指向クラブ', '978-4102938475'),
 ('B0000052', '止まらない世界', '978-4238764901'),
 ('B0000053', 'ららら', '978-4983740208')]

/*
8.4.2 出版社名もしくは所在地に「京」が含まれる出版社を検索しなさい。
*/

In [9]:
%%sql 
SELECT
    publisher_name
FROM
    publisher
WHERE
    publisher_name LIKE '%京%'
OR 
    prefecture LIKE '%京%'
;

 * postgresql://postgres:***@153.92.214.210:5432/er_sample
6 rows affected.

[('ピアソルエデュケーション',), ('講番社',), ('京葉プレス',), ('会経DP',), ('西京出版',), ('技術評価者',)]

/*
8.4.3 書籍の書籍名と価格の一覧を、結果表の見出しが「書籍名」、「価格」
となるように表示しなさい。ただし、ページ数が 
200 未満か 300 以上のデータのみを表示しなさい。
*/

In [11]:
%%sql
SELECT
    book_name AS "書籍名",   
    price AS "価格"
FROM
    book
WHERE
    page_count < 200
OR
    page_count >= 300
ORDER BY 
    price ASC
;

 * postgresql://postgres:***@153.92.214.210:5432/er_sample
32 rows affected.

[('誰よりもおいしく', 560),
 ('世紀末の隣人', 580),
 ('これからの世界', 580),
 ('一子相伝の極み', 689),
 ('沖縄の密約', 756),
 ('経営戦略を問い正す', 798),
 ('深海のシーラカンス', 799),
 ('楽しいプログラミング', 799),
 ('かしこい消費税', 799),
 ('恋のサブリミナル', 800),
 ('バスケがしたいです', 800),
 ('アインシュタイン16歳の現実', 819),
 ('ギャンブルにはビジネスの悪知恵が詰まっている', 880),
 ('冬のコナリ', 945),
 ('湯けむりの嗜み', 999),
 ('明けの明星', 999),
 ('からだのしくみ', 1000),
 ('より良い老後とは', 1200),
 ('昨日の晩ごはん', 1679),
 ('一日一膳', 1680),
 ('日本の夜明け', 1999),
 ('頑張ればJava', 2000),
 ('週末のオブジェクト指向クラブ', 2500),
 ('みんなでクラウド', 2999),
 ('献金！献金！また献金！', 3000),
 ('満月の神話 新装版', 3360),
 ('真珠のプログラミング', 3570),
 ('Effective Ruby 第2版', 3780),
 ('達人開発者', 3990),
 ('秘伝のタレ 新版', 3999),
 ('親父からのビジネス', 4000),
 ('UNIXネットワークプログラム', 8400)]

/*
8.4.4  2007 年度(2007 年 4 月 1 日~2008 年 3 月 31 日)に発売された価格が
 800 円以上の書籍の書籍名と ISBNの一覧を、結果表の見出しが
 「書籍名」、「ISBN」となるように表示しなさい。
*/

In [12]:
%%sql
SELECT
    book_id AS "書籍 ID",   
    isbn13 AS "ISBN"
FROM
    book
WHERE
    -- ((on_sale_date >= '2007-4-1') AND (on_sale_date <= '2008-3-31'))
    (on_sale_date BETWEEN '2007-4-1' AND '2008-3-31')
AND
    price >= 800
;

 * postgresql://postgres:***@153.92.214.210:5432/er_sample
6 rows affected.

[('B0000002', '978-4894714990'),
 ('B0000015', '978-4894712320'),
 ('B0000027', '978-4663512931'),
 ('B0000029', '978-4733522781'),
 ('B0000036', '978-4123512345'),
 ('B0000038', '978-4983779811')]

/*
8.4.5 東京都もしくは山梨県在住の正会員の会員 ID と姓、名の一覧を、
結果表の見出しが「会員 ID」、「姓」、「名」となるように表示しなさい。
*/

In [13]:
%%sql
SELECT
    member_id AS "会員 ID",
    first_name AS "名",
    last_name AS "姓"
FROM
    member
WHERE
    (address LIKE '東京都%' OR address LIKE '山梨県%')
AND 
    member_type = '1'
;

 * postgresql://postgres:***@153.92.214.210:5432/er_sample
4 rows affected.

[('003', '勝', '佐藤'),
 ('M002', '裕子', '田中'),
 ('M004', '武', '斉藤'),
 ('M006', '明仁', '内藤')]

/*
8.4.6 血液型が A 型もしくは AB 型の正会員の一覧を表示しなさい。
結果表は「生年月日」を見出しとして表示しなさい。
*/

In [14]:
%%sql
SELECT
    birthday AS "生年月日"
FROM
    member
WHERE
    (blood_type = 'A' OR blood_type = 'AB')
AND 
    member_type = '1'
;

 * postgresql://postgres:***@153.92.214.210:5432/er_sample
4 rows affected.

[(datetime.date(1979, 9, 20),),
 (datetime.date(1992, 5, 30),),
 (datetime.date(1993, 5, 10),),
 (datetime.date(1988, 8, 20),)]